In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('D:/Downloads/stats.csv')

In [3]:
df

        Name  Salary Country
0        Dan   40000     USA
1  Elizabeth   32000  Brazil
2        Jon   45000   Italy
3      Maria   54000     USA
4       Mark   72000     USA
5       Bill   62000  Brazil
6       Jess   92000   Italy
7      Julia   55000     USA
8       Jeff   35000   Italy
9        Ben   48000  Brazil

In [4]:
mean1=df['Salary'].mean()
mean1

53500.0

In [5]:
sum1=df['Salary'].sum()
sum1

535000

In [6]:
max1=df['Salary'].max()
max1

92000

In [7]:
count1=df['Salary'].count()
count1

10

In [8]:
min1=df['Salary'].min()
min1

32000

In [9]:
median=df['Salary'].median()
median

51000.0

In [10]:
mode1=df['Salary'].mode()
mode1

0    32000
1    35000
2    40000
3    45000
4    48000
5    54000
6    55000
7    62000
8    72000
9    92000
dtype: int64

# Measure of Symmetry

In [11]:
skew1=df.skew(axis=0, skipna=True)
skew1

Salary    1.021551
dtype: float64

In [4]:
#The skewness is positive so x will have right side tail

In [12]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import skew
from scipy.stats import kurtosis

In [13]:
pd.set_option("display.max_columns",None)
pd.options.display.float_format="{:,.2f}".format

In [14]:
xls=pd.read_csv('D:/Downloads/diamonds.csv')

In [15]:
xls.head()

   id  carat      cut color clarity  depth  table  price    x    y    z
0   1   0.23    Ideal     E     SI2  61.50  55.00    326 3.95 3.98 2.43
1   2   0.21  Premium     E     SI1  59.80  61.00    326 3.89 3.84 2.31
2   3   0.23     Good     E     VS1  56.90  65.00    327 4.05 4.07 2.31
3   4   0.29  Premium     I     VS2  62.40  58.00    334 4.20 4.23 2.63
4   5   0.31     Good     J     SI2  63.30  58.00    335 4.34 4.35 2.75

In [16]:
des_df=xls.drop(['id'],axis=1)
for col in des_df:
    if des_df[col].dtype == 'object':
        des_df=des_df.drop([col],axis=1)
des_r=des_df.describe()
des_r=des_r.rename(index={'50%':'median/50%'})
des_r

,carat,depth,table,price,x,y,z
count,"53,940.00","53,940.00","53,940.00","53,940.00","53,940.00","53,940.00","53,940.00"
mean,0.80,61.75,57.46,"3,932.80",5.73,5.73,3.54
std,0.47,1.43,2.23,"3,989.44",1.12,1.14,0.71
min,0.20,43.00,43.00,326.00,0.00,0.00,0.00
25%,0.40,61.00,56.00,950.00,4.71,4.72,2.91
median/50%,0.70,61.80,57.00,"2,401.00",5.70,5.71,3.53
75%,1.04,62.50,59.00,"5,324.25",6.54,6.54,4.04
max,5.01,79.00,95.00,"18,823.00",10.74,58.90,31.80

# Covariance and Correlation

In [17]:
bw=pd.read_csv('D:/Downloads/BirthWeight.csv')
bw.head()

   Infant ID  Gestational Age (Weeks)  Birth Weight (Grams)
0          1                    34.70                  1895
1          2                    36.00                  2030
2          3                    29.30                  1440
3          4                    40.10                  2835
4          5                    35.70                  3090

In [18]:
bw.set_index('Infant ID',inplace=True)
bw.head()

           Gestational Age (Weeks)  Birth Weight (Grams)
Infant ID
1                            34.70                  1895
2                            36.00                  2030
3                            29.30                  1440
4                            40.10                  2835
5                            35.70                  3090

In [19]:
bw.cov()

                         Gestational Age (Weeks)  Birth Weight (Grams)
Gestational Age (Weeks)                     9.96              1,798.02
Birth Weight (Grams)                    1,798.02            485,478.75

In [20]:
bw.corr(method="pearson")

                         Gestational Age (Weeks)  Birth Weight (Grams)
Gestational Age (Weeks)                     1.00                  0.82
Birth Weight (Grams)                        0.82                  1.00

In [18]:
#Covariance idnciates that there is correlation exists between two
#Correlation coefficient of 0.010 indicates the relationship between two is positive and strong